posts/2015-01-13-explain-everything.org
#+date: <2015-01-13>
#+filetags: teaching
#+title: Explain Everything

An Apple education representative recommended the iOS app "Explain Everything." I imported a Keynote presentation, talked through it, then posted the result to YouTube. It didn't take any time at all. Explain Everything looks like it will be a great tool for anyone teaching in a distance learning context.

#+begin_center
[[yt:3Aoa-yP5U_Y]]
#+end_center


#+begin_tagline
Tagged: [[file:../tags/teaching.org][Teaching]]
#+end_tagline
