docs/posts/2015-01-13-explain-everything.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Explain Everything</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Explain Everything</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
An Apple education representative recommended the iOS app &ldquo;Explain Everything.&rdquo; I imported a Keynote presentation, talked through it, then posted the result to YouTube. It didn&rsquo;t take any time at all. Explain Everything looks like it will be a great tool for anyone teaching in a distance learning context.
</p>

<div class="org-center">
<p>
<iframe width="440" height="335" src="https://www.youtube.com/embed/3Aoa-yP5U_Y" frameborder="0" allowfullscreen></iframe>
</p>
</div>


<div class="tagline" id="orgc55a2b1">
<p>
Tagged: <a href="../tags/teaching.html">Teaching</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
